fa-xbrl/src/Enums/velpo_BalanceTypes/velpo_BalanceTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>velpo_BalanceTypes</name>
  <enumValues>
    <name>Debit</name>
  </enumValues>
  <enumValues>
    <name>Credit</name>
  </enumValues>
  <enumValues>
    <name>None</name>
  </enumValues>
</mdclass:Enum>

fa-xbrl/src/Enums/velpo_ConceptTypes/velpo_ConceptTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>velpo_ConceptTypes</name>
  <enumValues>
    <name>Measure</name>
  </enumValues>
  <enumValues>
    <name>Info</name>
  </enumValues>
  <enumValues>
    <name>Tuple</name>
  </enumValues>
</mdclass:Enum>

fa-xbrl/src/ChartsOfAccounts/velpo_Reporting/velpo_Reporting.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>velpo_Reporting</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.velpo_HypercubeAxes</extDimensionTypes>
  <attributes>
    <name>DataType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_ValueDataTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ConceptType</name>
    <type>
      <types>EnumRef.velpo_ConceptTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>IsGroup</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExtDimensionCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IsAbstract</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsNillable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OverridesRef</name>
    <type>
      <types>ChartOfAccountsRef.velpo_Reporting</types>
    </type>
  </attributes>
  <attributes>
    <name>IsOverridden</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NamespaceURI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>QName</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Tuple</name>
    <attributes>
      <name>Concept</name>
      <type>
        <types>ChartOfAccountsRef.velpo_Reporting</types>
      </type>
    </attributes>
    <attributes>
      <name>Choice</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <accountingFlags>
    <name>TurnoversOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
</mdclass:ChartOfAccounts>

fa-xbrl/src/ChartsOfCharacteristicTypes/velpo_HypercubeAxes/velpo_HypercubeAxes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>velpo_HypercubeAxes</name>
  <type>
    <types>CatalogRef.velpo_DataValues</types>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>InfoData</name>
      <description>Info data</description>
      <type>
        <types>CatalogRef.velpo_DataValues</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>DataType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_ValueDataTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>HypercudeAxisType</name>
    <type>
      <types>EnumRef.velpo_HypercubeAxisTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>IsOverridden</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OverridesRef</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.velpo_HypercubeAxes</types>
    </type>
  </attributes>
  <attributes>
    <name>NamespaceURI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>QName</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

fa-xbrl/src/CommonModules/velpo_BusinessReportingCashed/Module.bsl
Function GetAccountingRecordType(RecordType) Export

	Return ?(RecordType = Enums.velpo_BalanceTypes.Debit, AccountingRecordType.Debit, AccountingRecordType.Credit);

КонецФункции // GetAccountingRecordType()

Function GetAxisTypeArray(Concept) Export

	Query = New Query;
	Query.SetParameter("Concept", Concept);
	Query.Text = 
	"SELECT
	|	ReportingExtDimension.ExtDimensionType AS AxisType
	|FROM
	|	ChartOfAccounts.Reporting.ExtDimensionTypes AS ReportingExtDimension
	|WHERE
	|	ReportingExtDimension.Ref = &Concept
	|";
	Return Query.Execute().Unload().UnloadColumn("AxisType");	

EndFunction // GetAxisTypeArray()

Function GetAxisValue(Ref) Export

	AxisStructure = velpo_CommonFunctions.ObjectAttributeValues(Ref, "AxisValueType, Description, ValueBoolean, ValueDate, ValueRef, ValueNumber");
	AttributeName = Catalogs.AxisMembers.GetAttributeTypeName(AxisStructure.AxisValueType);
	Return AxisStructure[AttributeName];	
	
EndFunction // GetAxisValue()

Function GetAxisValueType(Ref) Export

	Return velpo_CommonFunctions.ObjectAttributeValue(Ref, "AxisValueType");
		
EndFunction // GetAxisValue()

Function CheckElementIsBlock(Element) Export

	Return (velpo_CommonFunctions.ObjectAttributeValue(Element, "ConceptType") = Enums.velpo_BaseDataTypes.Block);

EndFunction // CheckElementIsBlock()

Function GetAxisTypeByName(Name) Export

	Return ChartsOfCharacteristicTypes.velpo_HypercubeAxes.FindByAttribute("Name", Name);
	
EndFunction // GetAxisTypeByName()

Function GetMemberValueByName(Name) Export

	Return Catalogs.velpo_MemberValues.FindByAttribute("Name", Name);
	
EndFunction // GetMemberValueByName()

Function GetConceptByName(Name) Export

	Query = New Query;
	Query.SetParameter("Name", Name);
	Query.Text =
	"SELECT TOP 1
	|	Reporting.Ref AS Ref
	|FROM
	|	ChartOfAccounts.Reporting AS Reporting
	|WHERE
	|	Reporting.Name = &Name
	|
	|ORDER BY
	|	Reporting.IsGroup DESC
	|";
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Return Selection.Ref;
	Else
		Return ChartsOfAccounts.velpo_Reporting.EmptyRef();
	EndIf;
	
EndFunction // GetConceptByName()

Function GetConceptValueType(Ref) Export

	ConceptValueTypeAttrib = velpo_CommonFunctions.ObjectAttributeValue(Ref, "DataType");
	Return velpo_CommonFunctions.ObjectAttributeValue(ConceptValueTypeAttrib, "ValueType");
	
EndFunction // GetConceptValueType()

Function GetConceptVariantType(Ref) Export

	Return velpo_CommonFunctions.ObjectAttributeValue(Ref, "ConceptVariant");
	
EndFunction // GetConceptVariantType()

Function GetConceptType(Ref) Export

	Return velpo_CommonFunctions.ObjectAttributeValue(Ref, "ConceptType");
	
EndFunction // GetConceptValueType()

Function GetAxisValueName(Ref) Export

	Return velpo_CommonFunctions.ObjectAttributeValue(Ref, "Name");

EndFunction // GetAxisValueName()

Function GetConceptValueName(Ref) Export

	Return velpo_CommonFunctions.ObjectAttributeValue(Ref, "Name");	

EndFunction // GetConceptValueName()

Function CheckComparisonQueryType(Ref, Name) Export
	
	Return (Ref = Enums.velpo_ComparisonQueryTypes[Name]);
	
EndFunction

Function CheckFilterQueryType(Ref, Name) Export
	
	Return (Ref = Enums.velpo_FilterQueryTypes[Name]);
	
EndFunction

Function GetXDTOSerializer() Export

	 Return New XDTOSerializer(XDTOFactory);
	
EndFunction // GetXDTOSeriliser()

Function CheckConceptIsMeasure(Element) Export
	Return (velpo_CommonFunctions.ObjectAttributeValue(Element, "ConceptVariant") = Enums.velpo_ConceptTypes.Measure);
EndFunction

Function CheckInHierarchy(Ref, Parent) Export
	
    Query = New Query;
	Query.SetParameter("Ref", Ref);
	Query.SetParameter("Parent", Parent);
	Query.Text =
	"SELECT TOP 1 
	|	&Ref IN HIERARCHY(&Parent) As Check
	|";
	Selection = Query.Execute().Select();
	Selection.Next();
	
	Return Selection.Check;
		
EndFunction

// TODO
Функция ПолучитьТаблицуРасчетныхПоказателей(Показатель, ВидДвижения) Экспорт
	
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Показатель", Показатель);
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Ссылка КАК Показатель,
	//|	Ссылка.Вид КАК ВидСчета,
	//|	Ссылка.Дебетовый КАК Дебетовый,
	//|	Ссылка.Кредитовый КАК Кредитовый
	//|ИЗ
	//|	ПланСчетов.Отчетный.Расчет
	//|ГДЕ
	//|	Показатель = &Показатель
	//|	И Ссылка.ПометкаУдаления = ЛОЖЬ
	//|	И Ссылка." + ?(ВидДвижения = "Дебет", "Дебетовый = ИСТИНА", "Кредитовый = ИСТИНА") + "
	//|	
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	Ссылка КАК Показатель,
	//|	Ссылка.Вид КАК ВидСчета,
	//|	Ссылка.Дебетовый КАК Дебетовый,
	//|	Ссылка.Кредитовый КАК Кредитовый
	//|ИЗ
	//|	ПланСчетов.Отчетный.Расчет
	//|ГДЕ
	//|	Показатель = &Показатель
	//|	И Ссылка.ПометкаУдаления = ЛОЖЬ
	//|	И Ссылка.Дебетовый = ЛОЖЬ
	//|	И Ссылка.Кредитовый = ЛОЖЬ
	//|";
	//ТаблицаПоказателей = Запрос.Выполнить().Выгрузить();
	//	
	//Возврат ТаблицаПоказателей;

КонецФункции
